{"status":"ok","totalResults":5,"articles":[{"source":{"id":null,"name":"The Star Online"},"author":"Manas Mishra, Carl O'Donnell","title":"Novavax coronavirus vaccine induces immune response in small study - The Star Online","description":"(Reuters) - Novavax Inc <NVAX.O> said on Tuesday its experimental COVID-19  vaccine produced antibodies against the novel coronavirus,  according to initial data from a small, early-stage clinical trial.","url":"https://www.thestar.com.my/news/world/2020/08/05/novavax-coronavirus-vaccine-induces-immune-response-in-small-study","urlToImage":"https://apicms.thestar.com.my/uploads/images/2020/08/05/807130.JPG","publishedAt":"2020-08-04T20:35:00Z","content":"(Reuters) - Novavax Inc said on Tuesday its experimental COVID-19 vaccine produced antibodies against the novel coronavirus, according to initial data from a small, early-stage clinical trial. \r\nThe … [+2627 chars]"},{"source":{"id":null,"name":"Malay Mail"},"author":"Malay Mail","title":"Vietnam’s new Covid-19 outbreak started in early July, says govt - Malay Mail","description":"HANOI, Aug 4 — Vietnam’s recent coronavirus outbreak in the central city of Danang, which led to over 200 cases and eight deaths, appears to have started early in July, the government said on toay, amid concern the virus may have been spreading undetected ear…","url":"https://www.malaymail.com/news/world/2020/08/04/vietnams-new-covid-19-outbreak-started-in-early-july-says-govt/1891056","urlToImage":"https://media.malaymail.com/resize_cache/uploads/articles/2020/2020-08/20200804danang-seo.JPG","publishedAt":"2020-08-04T15:00:10Z","content":"Healthcare workers wearing protective hazmat suits are seen inside the military hospital 17 amid of spread of the coronavirus disease (Covid-19) in Da Nang city, Vietnam August 4, 2020. Reuters pic\r\n… [+727 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"Willie Weir","title":"How we found coronavirus in a cat - Medical Xpress","description":"Since the outset of the coronavirus pandemic, the potential role of animals in catching and spreading the disease has been closely examined by scientists. This is because the virus that causes COVID-19 belongs to the family of coronaviruses that cause disease…","url":"https://medicalxpress.com/news/2020-08-coronavirus-cat.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2020/howwefoundco.jpg","publishedAt":"2020-08-04T13:30:02Z","content":"Since the outset of the coronavirus pandemic, the potential role of animals in catching and spreading the disease has been closely examined by scientists. This is because the virus that causes COVID-… [+4573 chars]"},{"source":{"id":null,"name":"CNBC"},"author":"Reuters","title":"Regeneron says antibody cocktail prevents and treats coronavirus in animals - CNBC","description":"Regeneron Pharmaceuticals said the Covid-19 antibody-drug combination it is developing both prevented and treated the disease in rhesus macaques and hamsters, adding to hope that it might work for people.","url":"https://www.cnbc.com/2020/08/04/regeneron-says-antibody-cocktail-prevents-and-treats-coronavirus-in-animals.html","urlToImage":"https://image.cnbcfm.com/api/v1/image/102748608-RTX1CSZA.jpg?v=1591874970","publishedAt":"2020-08-04T09:23:00Z","content":"Regeneron Pharmaceuticals said on Monday that the Covid-19 antibody-drug combination it is developing both prevented and treated the disease in rhesus macaques and hamsters, adding to hope that it mi… [+1784 chars]"},{"source":{"id":null,"name":"Paul Tan's Automotive News"},"author":"Jonathan Lee","title":"Proton sells 13,216 vehicles in July, highest in 8 years - paultan.org - Paul Tan's Automotive News","description":"It appears that the automotive market is steadily rebounding from the coronavirus pandemic, the total industry volume (TIV) reaching a 13-month high in July thanks to the sales and service tax exemptions. One big beneficiary …","url":"https://paultan.org/2020/08/04/proton-sells-13216-vehicles-in-july-highest-in-8-years/","urlToImage":"https://s3.paultan.org/image/2020/07/Proton_Saga_Anniversary_Edition_Bodykit_Accessories_Malaysia-1-1200x800.jpg","publishedAt":"2020-08-04T09:01:23Z","content":"It appears that the automotive market is steadily rebounding from the coronavirus pandemic, the total industry volume (TIV) reaching a 13-month high in July thanks to the sales and service tax exempt… [+2056 chars]"}]}